app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Rock"], ["created_at", "2024-01-29 19:42:34.581798"], ["updated_at", "2024-01-29 19:42:34.581798"]]